---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalLoopType
source: html/e19a91b9-b428-11a1-61a7-55296df56c2e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLoopType

Specifies kind of analytical model loop.

## Syntax (C#)
```csharp
public enum AnalyticalLoopType
```